"Close" = "Închidere";

"Scan Card" = "Scanare card";

"Scan card" = "Scanare card";

"The IBAN you entered is invalid." = "Codul IBAN pe care l-ați introdus nu este valid.";

"There was an error processing your card -- try again in a few seconds" = "A apărut o eroare la procesarea cardului dvs. -- încercați din nou în câteva secunde";

"There was an unexpected error -- try again in a few seconds" = "A apărut o eroare neașteptată -- încercați din nou în câteva secunde";

"Try again" = "Încercați din nou";

"We use Stripe to verify your card details. Stripe may use and store your data according its privacy policy. <a href='https://support.stripe.com/questions/stripes-card-image-verification'><u>Learn more</u></a>" = "Folosim Stripe pentru a verifica detaliile cardului dvs. Stripe poate utiliza și stoca datele dvs. în conformitate cu politica sa de confidențialitate. <a href='https://support.stripe.com/questions/stripes-card-image-verification'><u>Aflați mai multe</u></a>";

"Your card has expired" = "Cardul dvs. a expirat";

"Your card was declined" = "Cardul dvs. a fost respins";

"Your card's expiration month is invalid" = "Luna de expirare a cardului dvs. nu este validă";

"Your card's expiration year is invalid" = "Anul de expirare al cardului dvs. nu este valid";

"Your card's number is invalid" = "Numărul cardului dvs. nu este valid";

"Your card's security code is invalid" = "Codul de securitate al cardului dvs. nu este valid";

"Your name is invalid." = "Numele dvs. nu este valid.";

"Your payment method was declined." = "Metoda dvs. de plată a fost respinsă.";
